[
  {
    "icon": "",
    "name": "Empty",
    "components": []
  },
  {
    "icon": "./logos/Frontend/frontend.png",
    "name": "Frontend",
    "components": [
      {
        "item": "React",
        "image": "./logos/Frontend/react.png",
        "snippet": "<p>React has been a key tool in my development workflow, enabling the creation of feature-rich, dynamic web applications with an emphasis on performance and user satisfaction. My expertise includes crafting reusable components, managing complex application states, and optimizing scalability for high-demand environments. React's declarative approach and robust ecosystem allow me to deliver intuitive and reliable front-end solutions.</p><b>Notable React Projects: </b>",
        "url": [
          "https://react-tech-blog.pages.dev",
          "https://applicant-tracking-system-three.vercel.app/dashboard"
        ],
        "images": []
      },
      {
        "item": "Next.js",
        "image": "./logos/Frontend/next.png",
        "snippet": "<p>Next.js has been instrumental in building fast, scalable, and SEO-friendly web applications. Leveraging its hybrid static and server-side rendering capabilities, I have optimized performance and enhanced user experiences. My expertise includes dynamic routing, API routes, middleware, and seamless integration with various backend services. With Next.js, I develop maintainable and high-performing applications that meet modern web standards.</p><b>Notable Next.js Projects: </b>",
        "url": [
          "https://izam-next-js-project.vercel.app"
        ],
        "images": []
      },
      {
        "item": "Vue",
        "image": "./logos/Frontend/vue.png",
        "snippet": "<p>I specialize in leveraging Vue.js to craft scalable, maintainable, and highly interactive web applications. From lightweight, fast-loading interfaces to architecting modular, large-scale front-end systems, my focus remains on delivering seamless user experiences. By utilizing Vue's flexibility and robust ecosystem, I ensure efficient, maintainable, and future-ready solutions.</p><b>Notable Vue.js Projects: </b>",
        "url": [
          "https://vue-full-stack-project-zdcm.vercel.app/"
        ],
        "images": [
          "./images/sunsolar.jpg"
        ]
      },
      {
        "item": "Nuxt",
        "image": "./logos/Frontend/nuxt.png",
        "snippet": "<p>Nuxt.js empowers me to build performant and SEO-friendly web applications tailored to modern user and business requirements. I've worked on projects ranging from server-side rendered (SSR) solutions to static site generation (SSG), ensuring optimal performance and scalability. By leveraging Nuxt's modular design and comprehensive features, I deliver robust and efficient front-end architectures.</p><b>Notable Nuxt.js Projects: </b>",
        "url": [
          "https://vue-nuxt3.pages.dev"
        ],
        "images": []
      },
      {
        "item": "Angular",
        "image": "./logos/Frontend/angular.png",
        "snippet": "<p>I've worked extensively with Angular to build dynamic, responsive web applications that prioritize performance and user experience. My expertise spans from developing small-scale applications to architecting complex, enterprise-level systems, utilizing Angular's powerful tools and best practices for high-quality front-end development.</p><b>Notable Angular Projects: </b><p>Such as this portfolio, developed using Angular v18, which showcases the versatility and power of the framework in creating modern and dynamic web applications. The project is hosted on GitHub and leverages GitHub Actions to automate testing and build processes, ensuring code quality and generating the final production-ready assets.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Django",
        "image": "./logos/Backend/django.png",
        "snippet": "<p>I specialize in Django, building robust and scalable web applications with clean and efficient code. Leveraging Django's modular architecture and powerful ORM, I create secure back-end systems, dynamic APIs, and seamless integrations that drive business growth.</p>",
        "url": [
          "https://maherawsrabbitmq.zapto.org/django"
        ],
        "images": []
      },
      {
        "item": "Webpack",
        "image": "./logos/Frontend/webpack.png",
        "snippet": "<p>I have a deep understanding of Webpack and its role in optimizing modern web applications. From configuring basic setups to implementing advanced features like code splitting, lazy loading, and tree shaking, I've leveraged Webpack to significantly enhance build performance and reduce load times. My experience includes optimizing assets, integrating plugins, and fine-tuning production builds to ensure a seamless development and deployment workflow.</p><p>In one of my key projects, I utilized Webpack to optimize a complex, multi-page application, significantly enhancing both its performance and scalability. This optimization involved implementing advanced techniques such as code splitting, lazy loading, and efficient asset management, leading to faster load times and a more scalable architecture.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "CSS Effects",
        "image": "./logos/Frontend/css.svg",
        "snippet": "<p>I leverage modern CSS to craft visually appealing, responsive, and accessible user interfaces. My expertise spans from building clean layouts with Flexbox and Grid, to enhancing interactivity through smooth transitions, animations, and hover effects. I focus on creating elegant micro-interactions that improve usability while maintaining performance and cross-browser compatibility. With CSS, I aim to deliver polished and engaging front-end experiences that complement the functionality of my applications.</p><b>Live CSS Showcase: </b>",
        "url": [
          "https://maher-saleh.github.io/css-styles-animations"
        ],
        "images": []
      }
    ]
  },
  {
    "icon": "./logos/Backend/backend.png",
    "name": "Backend",
    "components": [
      {
        "item": "PHP",
        "image": "./logos/Backend/php.png",
        "snippet": "<p>I have extensive experience with PHP, using it to build secure, high-performance back-end systems and APIs. From legacy code optimization to modern frameworks, I apply best practices in coding, testing, and scalability to deliver reliable solutions.</p>",
        "url": [
          "https://vue-nuxt3.pages.dev"
        ],
        "images": []
      },
      {
        "item": "Laravel",
        "image": "./logos/Backend/laravel.png",
        "snippet": "<p>With strong expertise in Laravel, I design and implement clean, maintainable, and scalable web applications. Leveraging Laravel’s rich ecosystem, I deliver features rapidly while ensuring robust architecture, optimized queries, and seamless integration with third-party services.</p>",
        "url": [
          "https://applicant-tracking-system-three.vercel.app/dashboard",
          "https://react-tech-blog.pages.dev"
        ],
        "images": []
      },
      {
        "item": "Python",
        "image": "./logos/Backend/python.png",
        "snippet": "<p>I bring deep expertise in Python, leveraging its versatility to build everything from robust back-end systems to data-driven applications. With experience in frameworks like Django and Flask, I craft scalable, secure, and efficient solutions tailored to diverse project needs.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Node.js",
        "image": "./logos/Backend/node-js.png",
        "snippet": "<p>As a seasoned Node.js developer, I specialize in creating fast, scalable, and efficient server-side applications. From RESTful APIs to real-time applications, I harness Node.js's non-blocking architecture to deliver seamless and high-performing solutions.</p>",
        "url": [
          "https://vue-full-stack-project-zdcm.vercel.app/"
        ],
        "images": [
          "./images/sunsolar.jpg"
        ]
      },
      {
        "item": "Ruby on Rails",
        "image": "./logos/Backend/rails.png",
        "snippet": "<p>With a strong foundation in Ruby on Rails, I excel in building clean, maintainable, and scalable web applications. I utilize Rails' convention-over-configuration philosophy to streamline development and deliver intuitive, feature-rich solutions.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Java",
        "image": "./logos/Backend/java.png",
        "snippet": "<p>My proficiency in Java spans across building reliable enterprise-level applications, scalable web services, and secure back-end systems. With expertise in frameworks like Spring and Hibernate, I deliver high-performance software that meets complex business requirements.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Spring Boot",
        "image": "./logos/Backend/spring-boot.png",
        "snippet": "<p>I specialize in Spring Boot for building enterprise-grade applications with a focus on performance, scalability, and security. By leveraging Spring’s ecosystem, I deliver robust RESTful APIs, microservices architectures, and seamless integrations with databases and cloud platforms.</p>",
        "url": [
          "https://izam-next-js-project.vercel.app"
        ],
        "images": []
      },
      {
        "item": "Redis",
        "image": "./logos/Backend/redis.png",
        "snippet": "<p>With extensive experience using Redis as a backend technology, I leverage its in-memory data structure store to optimize application performance. By implementing Redis for caching, session management, and real-time data processing, I enhance scalability and reduce latency, ensuring efficient and high-performance backend systems.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Django",
        "image": "./logos/Backend/django.png",
        "snippet": "<p>I specialize in Django, building robust and scalable web applications with clean and efficient code. Leveraging Django's modular architecture and powerful ORM, I create secure back-end systems, dynamic APIs, and seamless integrations that drive business growth.</p>",
        "url": [
          "https://maherawsrabbitmq.zapto.org/django"
        ],
        "images": []
      },
      {
        "item": "Rest APIs",
        "image": "./logos/Backend/api.png",
        "snippet": "<p>I excel in designing and implementing RESTful APIs that are intuitive, scalable, and secure. By adhering to best practices and industry standards, I ensure seamless integration and robust communication between systems, delivering exceptional user experiences.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "GraphQL",
        "image": "./logos/Backend/graphql.png",
        "snippet": "<p>With expertise in GraphQL, I craft dynamic and flexible APIs that empower clients to fetch exactly the data they need. By designing efficient schemas and resolvers, I optimize data querying and streamline performance for modern, data-driven applications.</p>",
        "url": [],
        "images": []
      }
    ]
  },
  {
    "icon": "./logos/Databases/databases.png",
    "name": "Databases",
    "components": [
      {
        "item": "MySQL",
        "image": "./logos/Databases/mysql.png",
        "snippet": "<p>I possess deep expertise in MySQL, expertly managing relational databases to ensure data integrity, high availability, and scalability. With advanced knowledge of complex queries, indexing, and optimization techniques, I design efficient database structures that support high-performance applications.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "PostgreSQL",
        "image": "./logos/Databases/postgres.png",
        "snippet": "<p>As an experienced PostgreSQL developer, I leverage its robust features like ACID compliance, complex joins, and custom functions to build scalable and reliable database systems. I optimize performance through indexing, query tuning, and efficient data models, ensuring seamless and secure data management for enterprise applications.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "MongoDB",
        "image": "./logos/Databases/mongodb.png",
        "snippet": "<p>With extensive experience in MongoDB, I design and implement scalable NoSQL database solutions that handle large volumes of unstructured data. I expertly utilize MongoDB's flexible schema and powerful aggregation framework to build fast, high-performing applications with dynamic and efficient data storage.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "MariaDB",
        "image": "./logos/Databases/mariadb.png",
        "snippet": "<p>Having worked extensively with MariaDB, I utilize its high-performance capabilities to build highly available, secure, and scalable databases. I focus on optimizing queries, ensuring proper indexing, and configuring replication to support critical, large-scale applications while maintaining data consistency and performance.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Cassandra",
        "image": "./logos/Databases/cassandra.png",
        "snippet": "<p>My proficiency in Cassandra enables me to design highly scalable, fault-tolerant distributed databases for handling massive datasets across multiple nodes. I implement effective data models and ensure optimal configuration for performance, durability, and availability, making Cassandra an ideal solution for big data applications.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Redis",
        "image": "./logos/Databases/redis.png",
        "snippet": "<p>I utilize Redis as a powerful database solution, taking full advantage of its in-memory capabilities to deliver lightning-fast data access. With expertise in setting up Redis for both persistence and transient data storage, I ensure seamless performance for real-time applications that require low-latency and high-throughput data operations.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Firebase",
        "image": "./logos/Databases/firebase.png",
        "snippet": "<p>With expertise in Firebase, I integrate real-time databases, authentication, and cloud functions to build dynamic, scalable applications. I leverage Firebase's seamless sync capabilities and powerful backend services to create responsive mobile and web applications that scale effortlessly and deliver an exceptional user experience.</p>",
        "url": [],
        "images": []
      }
    ]
  },
  {
    "icon": "./logos/DevOps/devops.png",
    "name": "DevOps",
    "components": [
      {
        "item": "RabbitMQ",
        "image": "./logos/DevOps/rabbitmq.png",
        "snippet": "<p>I have a deep understanding of RabbitMQ for building highly scalable and reliable message queuing systems. By implementing RabbitMQ's advanced routing, clustering, and failover strategies, I ensure that real-time messaging and event-driven architecture solutions are both robust and performant.</p><b>See How I Use RabbitMQ to Power Two Distinct Services:</b>",
        "url": [
          "https://maherawsrabbitmq.zapto.org/producer/",
          "https://maherawsrabbitmq.zapto.org/consumer/"
        ],
        "images": []
      },
      {
        "item": "kafka",
        "image": "./logos/DevOps/kafka.png",
        "snippet": "<p>With extensive experience in Apache Kafka, I design and implement high-throughput, fault-tolerant data streaming solutions. I utilize Kafka's robust messaging and real-time event processing capabilities to handle large-scale data pipelines, enabling real-time analytics and ensuring system reliability at scale.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "AWS",
        "image": "./logos/DevOps/aws.png",
        "snippet": "<p>I design and implement cloud-based solutions leveraging AWS's suite of services to ensure scalability, security, and high availability. From EC2 to S3, Lambda, and RDS, I architect robust infrastructures, optimize costs, and deliver highly available, fault-tolerant systems tailored to enterprise needs.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Azure",
        "image": "./logos/DevOps/azure.png",
        "snippet": "<p>With hands-on experience in Microsoft Azure, I build and manage cloud applications that are secure, scalable, and cost-efficient. I specialize in services like Azure App Services, Virtual Machines, and Azure SQL, enabling seamless cloud transitions and powerful integrations that support business growth and performance.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Google Cloud",
        "image": "./logos/DevOps/google-cloud.png",
        "snippet": "<p>Leveraging Google Cloud's advanced tools, I architect scalable and reliable cloud solutions, utilizing services such as Compute Engine, Kubernetes Engine, and BigQuery. I optimize cloud infrastructure for high availability, performance, and cost efficiency, ensuring that applications run seamlessly on Google's cloud platform.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Apache",
        "image": "./logos/DevOps/apache.png",
        "snippet": "<p>I have extensive experience configuring and managing Apache HTTP Server to optimize web application performance. With expertise in reverse proxy setups, SSL configurations, and fine-tuning server settings, I ensure fast, reliable, and secure web hosting environments that support high-traffic applications.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Nginx",
        "image": "./logos/DevOps/nginx.png",
        "snippet": "<p>As a skilled Nginx administrator, I configure high-performance web servers and reverse proxies to ensure fast, secure, and scalable application delivery. My expertise includes load balancing, SSL offloading, and optimizing server configurations to handle large-scale traffic with minimal latency.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Jenkins",
        "image": "./logos/DevOps/jenkins.png",
        "snippet": "<p>As a DevOps engineer, I expertly configure and manage Jenkins to automate the entire CI/CD pipeline. I integrate Jenkins with various tools, ensuring streamlined code testing, building, and deployment, while optimizing workflows to improve development speed and reduce errors in production environments.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "TeamCity",
        "image": "./logos/DevOps/teamcity.png",
        "snippet": "<p>With extensive experience using TeamCity, I automate build, test, and deployment pipelines, ensuring consistent and high-quality delivery. I leverage TeamCity's powerful integration capabilities and real-time feedback to streamline DevOps processes, making continuous integration and delivery seamless and efficient.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "GitLab",
        "image": "./logos/DevOps/gitlab.png",
        "snippet": "<p>I specialize in GitLab for version control, CI/CD pipelines, and project management. By integrating GitLab with various tools, I enable automated workflows that accelerate development cycles, improve collaboration, and ensure a streamlined, efficient approach to delivering production-ready code.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "GitHub Actions",
        "image": "./logos/DevOps/github-actions.png",
        "snippet": "<p>With in-depth experience using GitHub Actions, I automate CI/CD pipelines directly within GitHub repositories. I design workflows that test, build, and deploy applications, ensuring high-quality code delivery while minimizing errors and delays in the development process.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Docker",
        "image": "./logos/DevOps/docker.png",
        "snippet": "<p>I have extensive experience with Docker, utilizing containerization to build, deploy, and scale applications across environments. I create efficient Docker images, optimize container orchestration, and ensure smooth CI/CD workflows, enabling fast and consistent deployment of microservices.</p>",
        "url": [],
        "images": []
      },
      {
        "item": "Kubernetes",
        "image": "./logos/DevOps/kubernetes.png",
        "snippet": "<p>As a Kubernetes expert, I manage containerized applications at scale, ensuring seamless orchestration, scaling, and high availability. By leveraging Kubernetes' advanced features such as deployments, services, and persistent storage, I optimize resource utilization and improve the scalability of complex cloud-native applications.</p>",
        "url": [],
        "images": []
      }
    ]
  },
  {
    "icon": "./logos/Cross Platforms/cross_platforms.png",
    "name": "Cross Platforms",
    "components": [
      {
        "item": "Flutter",
        "image": "./logos/Cross Platforms/flutter.png",
        "snippet": "<p>I have a strong background in using Flutter to build high-performance, cross-platform mobile and web applications that deliver seamless user experiences. From creating user-friendly mobile apps to developing feature-rich, scalable solutions, my expertise in Flutter empowers me to utilize its rich widget library and efficient rendering engine to build visually appealing and responsive interfaces across multiple platforms with a single codebase.</p><b>Notable Flutter Projects:</b><p>These include a variety of applications designed for both iOS and Android, demonstrating Flutter's capabilities in delivering native-like performance and robust functionality.</p><small><i>Examples and screenshots of these projects will be uploaded shortly.</i></small>",
        "url": [],
        "images": []
      },
      {
        "item": "React native",
        "image": "./logos/Cross Platforms/react_native.png",
        "snippet": "<p>I have extensive experience leveraging React Native to develop high-performance, cross-platform mobile applications that deliver native-like experiences on both iOS and Android. My expertise in React Native allows me to create robust, scalable solutions that seamlessly blend performance and functionality. By utilizing its powerful component-based architecture and rich ecosystem, I craft responsive and user-friendly interfaces, ensuring smooth navigation and efficient state management. My proficiency in React Native enables me to integrate advanced native modules and third-party libraries, ensuring versatile and customized solutions that meet diverse business requirements.</p><b>Notable Flutter Projects:</b><p>These include feature-rich mobile applications that showcase React Native's ability to deliver consistent performance and outstanding user experiences across multiple platforms.</p><small><i>Examples and screenshots of these projects will be uploaded shortly.</i></small>",
        "url": [],
        "images": []
      },
      {
        "item": "Electron.js",
        "image": "./logos/Cross Platforms/electron.png",
        "snippet": "<p>I possess a deep understanding of Electron.js for building cross-platform desktop applications using familiar web technologies such as HTML, CSS, and JavaScript. My experience with Electron enables me to create high-performance, desktop-grade solutions that are both scalable and maintainable. Leveraging Electron's robust framework, I develop feature-rich applications that combine the power of Node.js on the backend with seamless frontend interfaces. My skills extend to optimizing memory usage, managing security protocols, and ensuring native integration with operating systems, resulting in reliable and efficient desktop applications.</p><b>Notable Flutter Projects:</b><p>These include versatile desktop applications that highlight Electron's capability to deliver native-like performance while utilizing a single codebase across Windows, macOS, and Linux platforms.</p><small><i>Examples and screenshots of these projects will be uploaded shortly.</i></small>",
        "url": [],
        "images": []
      }
    ]
  }
]